OpenFOAM-v2112-AD/tutorials/lagrangian/uncoupledKinematicParcelDyMFoam/rotor2DAMI/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 350;

boundaryField
{
    AMI1a
    {
        type            cyclicAMI;
        value           $internalField;
    }

    AMI1b
    {
        type            cyclicAMI;
        value           $internalField;
    }

    ".*"
    {
        type            zeroGradient;
        value           $internalField;
    }

    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
